# Задача 2. Вариант 14.
# Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Конфуций. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Герман
# 4.06.2016


print("Молчание - верный друг, который никогда не изменит.")
input("															  Конфуций")